In [1]:
!pip install trino

Collecting trino
  Downloading trino-0.336.0-py3-none-any.whl.metadata (20 kB)
Requirement already satisfied: lz4 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from trino) (4.4.4)
Collecting orjson>=3.11.0 (from trino)
  Downloading orjson-3.11.3-cp312-cp312-manylinux_2_17_aarch64.manylinux2014_aarch64.whl.metadata (41 kB)
Requirement already satisfied: python-dateutil in /srv/conda/envs/notebook/lib/python3.12/site-packages (from trino) (2.9.0.post0)
Requirement already satisfied: pytz in /srv/conda/envs/notebook/lib/python3.12/site-packages (from trino) (2025.2)
Requirement already satisfied: requests>=2.32.4 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from trino) (2.32.4)
Collecting tzlocal (from trino)
  Downloading tzlocal-5.3.1-py3-none-any.whl.metadata (7.6 kB)
Requirement already satisfied: zstandard in /srv/conda/envs/notebook/lib/python3.12/site-packages (from trino) (0.23.0)
Requirement already satisfied: charset_normalizer<4,>=2 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from requests>=2.32.4->trino) (3.4.2)
Requirement already satisfied: idna<4,>=2.5 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from requests>=2.32.4->trino) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from requests>=2.32.4->trino) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from requests>=2.32.4->trino) (2025.10.5)
Requirement already satisfied: six>=1.5 in /srv/conda/envs/notebook/lib/python3.12/site-packages (from python-dateutil->trino) (1.17.0)
Downloading trino-0.336.0-py3-none-any.whl (57 kB)
Downloading orjson-3.11.3-cp312-cp312-manylinux_2_17_aarch64.manylinux2014_aarch64.whl (123 kB)
Downloading tzlocal-5.3.1-py3-none-any.whl (18 kB)
Installing collected packages: tzlocal, orjson, trino
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [trino]
Successfully installed orjson-3.11.3 trino-0.336.0 tzlocal-5.3.1

In [2]:
from trino.dbapi import connect

In [7]:
# Trino connection configuration
conn = connect(
    host='trino',
    user='teehr',
    catalog='iceberg',
    schema='teehr',
    http_scheme='http',
    # For production, add authentication:
    # auth=BasicAuthentication("username", "password")
)

In [8]:
import pandas as pd
sql = "SELECT * from iceberg.teehr.sample"
df = pd.read_sql(sql, conn)

/tmp/ipykernel_113/4175621912.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

In [9]:
df

     id      name      value  value_rounded category
0   750  name_750  81.155660          81.16     high
1   751  name_751  85.225958          85.23     high
2   752  name_752  58.971393          58.97   medium
3   753  name_753  67.773620          67.77   medium
4   754  name_754  28.315013          28.32      low
..  ...       ...        ...            ...      ...
95  845  name_845  87.931824          87.93     high
96  846  name_846  47.281422          47.28   medium
97  847  name_847  88.105569          88.11     high
98  848  name_848  89.328458          89.33     high
99  849  name_849  80.607109          80.61     high

[100 rows x 5 columns]